[
    {
        "Label": 1,
        "Video URL": "https://www.youtube.com/watch?v=m0gqEfUL-GQ",
        "Title": "Revisiting Hall’s Pictorial Weekly in Kilgarvan, Co. Kerry, Ireland 1976",
        "Description": "The people of Kilgarvan in Kerry are the stars of this opening sequence to ‘Hall’s Pictorial Weekly’.\n\nThe village of Kilgarvan (in Irish Cill Gharbháin, meaning church of Saint Garbhan) is situated between Killarney and Kenmare in County Kerry.\n\nPeople going about their business are happy to wave to the camera crew, who provide a welcome diversion for children in the national school. A vehicle tyre requires air, and supplies for one of the businesses in the village are being unloaded.\n\nOnce a week, from June to September, the ‘Hall’s Pictorial Weekly’ film crew would arrive at a town or village in any county in Ireland. They would film the people and the place and return to RTÉ where the footage was edited and the theme music added.\n\nThis short film of around one minute’s duration formed part of the opening sequence for that week’s episode. No-one knew which location had been chosen, and it was not advertised as part of the programme billings in the RTÉ Guide or newspapers.\n\nSo with this in mind, people the length and breadth of the country tuned in religiously, in case it was the turn of their town or village to have its few minutes of fame.\n\nThis episode of ‘Hall’s Pictorial Weekly’ broadcast on 28 May 1976.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-12-12 13:38:29"
    },
    {
        "Label": 2,
        "Video URL": "https://www.youtube.com/watch?v=oOjK3lCNNII",
        "Title": "Revisiting Ireland's U16 European Football Champions Return Home, 1998",
        "Description": "A victorious Under-16 Republic of Ireland soccer team return home to a rousing welcome after winning the UEFA Championships.\n\nThe Irish squad was greeted at Dublin Airport by hundreds of supporters. Captain Shaun Byrne was the first off the specially chartered flight with the UEFA cup in hand. He was followed by manager Brian Kerr and the rest of the young team who joined in song to sing ‘The Fields of Athenry’ as they posed for photographs.  \n\nFor manager Brian Kerr, this was a truly magical moment. \n\nThe squad was then taken by open top bus to the Forte Crest Hotel for a press conference where Shaun Byrne thanks manager Brian Kerr and coach Noel O’Reilly for their support. \n\nIt’s a memory that will always stay with me and I’m just very proud of what the team has achieved.\n\nThe Republic of Ireland squad became European Champions after beating Italy 2-1. \n\nAn RTÉ News report broadcast on 9 May 1998. The reporter is Peter Leonard.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-08-08 01:06:07"
    },
    {
        "Label": 3,
        "Video URL": "https://www.youtube.com/watch?v=_dT05h75UTs",
        "Title": "Revisiting Home Again",
        "Description": "The Big Geraniums are in international group with three Irish members, four English and one from America.\n\nThe Big Geraniums formed in Covent Garden in London, where the band a familiar site busking. They moved to Ireland in September and spent their first night in Dublin under the stars in Saint Stephen’s Green. The following morning, they started to busk. They made £120 in half an hour and decided that Ireland was the place to be.\n\nHaving signed a major record deal with Polygram Records The Big Geraniums perform their first single ‘Home Again’ which is currently at number seven in the Irish singles chart.\n\nThis episode of ‘Kenny Live’ was broadcast on 16 November 1991. The presenter is Pat Kenny.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-08-15 17:17:44"
    },
    {
        "Label": 4,
        "Video URL": "https://www.youtube.com/watch?v=Du3GHSUVySU",
        "Title": "Revisiting Dermot Morgan Tribute Book Launch, Ireland 1998",
        "Description": "Memories shared of comedian Dermot Morgan at the launch of a biography written by his sons.\n\nDermot Morgan’s sons Don and Bobby have compiled a biography of their father recalling the life and times of the comedian and actor.\n\nDermot Morgan was remembered by relatives, friends and admirers at his local pub in Dublin last night.\n\nThe book titled ‘Our Father’, written by his sons Don and Bobby, was launched by broadcaster Pat Kenny. Also in attendance was Dermot’s five year old son Ben as well as co-stars from the television comedy series ‘Father Ted’.\n\nDermot Morgan died at a dinner party in his home in London on 28 February 1998.\n\nAn RTÉ News report broadcast on 26 November 1998. The reporter is Colm Connolly.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-08-22 05:03:43"
    },
    {
        "Label": 5,
        "Video URL": "https://www.youtube.com/watch?v=DEbVUBp3Qvc",
        "Title": "Revisiting Meet The Connolly Hurling Brothers from Castlegar, Co. Galway, Ireland 1982",
        "Description": "Meet the Connolly Brothers from Castlegar who are champion hurlers, Gaeilgeoirí and hurley makers.\n\nPat and Máire Connolly have ten children – Máire, Sarah, John, Padraig, Michael, Philomena, Joe, Gerry, Tom, and Murt. The Connolly children grew up in Castlegar, with strong roots in the Connemara of their parents’ birth, and a deep pride in their country.\n\nJoe, John, Michael and Gerry turned out to be champion hurlers.  The array of trophies in Pat and Máire’s living room would not look out of place in a hurling museum and is a testament to their hurling talents and sportsmanship, not only in the All-Ireland, but also in the Railway Cup, and a host of county championships.  As hurlers, it seemed they were unstoppable,\n\nA bhfuil le buach ann san iománaíocht, tá sé buaite acu.\n\nTheir father Pat is particularly proud of their All-Ireland win for Galway in 1980, given that the Galway hurling team languished in the doldrums for so long.\n\nBut how did they grow up bilingual, so close to Galway City?  John Connolly was born in Connemara, but moved with his parents to Castlegar at the age of five. Despite being surrounded by English speakers, the children never lost their Irish, as their mother and father insisted that they speak it at home,\n\n...Gaeilge teanga an tí i gcónaí.\n\nThe language and the Connemara traditions that their parents kept alive enabled them to keep a foot in two camps so that they felt equally at home when in Connemara as in Galway city. \n\nSuch is the high regard that people have for this band of brothers, that Taoiseach Charles Haughey was present at the official opening of their joinery factory, in Laghtgeorge, County Galway. \n\nThe relationship between a player and their hurley is a personal one, and something which develops as the skill of the hurler develops.  While Joe Connolly can see the benefits of plastic hurleys, especially for children, when it comes to playing in a match, the real thing is required.\n\nJoe takes reporter Breandán Ó hEithir through the hurley making process. The starting point of every hurley’s journey is the raw wood, ash, which is carefully selected, and carved into planks. These are then placed in a special machine where they are planed down before being finished by hand. The entire process takes time and skill before the finished product emerges,\n\nTá sé cineál céim ar chéim, like, agus tagann an cruth an chamán air.\n\n \nThis episode of ‘Féach’ was broadcast on 7 May 1982. The reporter is Breandán Ó hEithir\n\n‘Féach’ was an Irish language current affairs programme which went out on RTÉ Television from 1967 to 1985.  Presenters and reporters were Breandán Ó hEithir, Prionsias Mac Aonghusa, Andy O’Mahony, Doireann Ní Bhriain,  Eamonn Ó Muirí, Mícheál Ó hUanacháin and Poilín Ní Chiaráin.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-08-29 16:32:23"
    },
    {
        "Label": 6,
        "Video URL": "https://www.youtube.com/watch?v=W4u4mX18kyU",
        "Title": "Revisiting A Supersonic Trip On Concorde, 1977",
        "Description": "Taking a flight on Concorde, Mike Murphy is well fed and gets some golf practice all while travelling at twice the speed of sound.\n\nThe RAF airfield at Brize Norton in Oxfordshire is the training base for Concorde pilots. Mike Murphy meets Chief Training Officer Captain Norman Todd, who was the pilot of Concorde’s inaugural flight to Washington, and watches as a Concorde plane lands at approximately 170 mph. \n\nTraining pilots to fly Concorde doesn’t come cheap. The cost of each training flight comes in at over £10,000.\n\nOn a 90-minute training flight Concorde uses up 23 tonnes of fuel.\n\nPilot Kitt says of flying Concorde.\n\nIt’s a very smooth, very precise aircraft.\n\nFlying by Concorde is no ordinary affair. In the departure lounge, Mike Murphy is presented with a glass of champagne. On board, he is again indulged with more champagne, describing it as,\n\nUndoubtedly, the toughest assignment I’ve been on.\n\nDescribing his first impressions on board Concorde, Mike Murphy says it is a little disappointing. While there is more leg room and top-notch service, the windows are smaller.\n\nOriginally the designers didn’t want to include windows at all.\n\nA return fair from Dublin to Bahrain of £776 with a flight time of four hours and ten minutes, as opposed to six hours and twenty minutes on a sub-sonic flight. \n\nThe silver service catering on board is second to none. The lunch menu includes smoke salmon and foie gras canapes, chilled caviar from Iran, sirloin steak, Marchand du Vin, breast of duckling, and fillets of sole, which Mike Murphy describes as just like the food available in the RTÉ canteen. \n\nDuring the flight at a speed of 670 mph, the captain makes a special announcement welcoming RTÉ and Mike Murphy on board. \n\nI’d like to welcome on board the Irish television company.\n\n He is surprised on a visit to the cockpit during the flight and how small and cramped it is. \n\nWe’re right in the very front of a very sharp aircraft.\n\nNow travelling at twice the speed of sound, at about 23 miles per minute. \n\nWe’re travelling faster than the speed of a rifle bullet. It’s quite mind-boggling.\n\nPutting a golf ball on board Concorde while travelling at twice the speed of sound Mike Muprhy calculates that the ball travelled the equivalent of two miles in the four seconds it took to take the putt. \n\nThis episode of ‘The Likes of Mike’ was broadcast on 8 March 1977. The presenter is Mike Murphy.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-09-05 20:12:10"
    },
    {
        "Label": 7,
        "Video URL": "https://www.youtube.com/watch?v=BUxXLDC7kR4",
        "Title": "Revisiting Making Hurleys in Castlegar, Co. Galway, Ireland 1982",
        "Description": "Joe Connolly from Castlegar, Co. Galway is a Champion hurler, Gaeilgeoir and hurley maker & who takes reporter Breandán Ó hEithir through the hurley making process. \nThe starting point of every hurley’s journey is the raw wood, ash, which is carefully selected, and carved into planks. These are then placed in a special machine where they are planed down before being finished by hand. The entire process takes time and skill before the finished product emerges,\n\nTá sé cineál céim ar chéim, like, agus tagann an cruth an chamán air.\n \nThis episode of ‘Féach’ was broadcast on 7 May 1982. The reporter is Breandán Ó hEithir\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-09-12 02:53:48"
    },
    {
        "Label": 8,
        "Video URL": "https://www.youtube.com/watch?v=4nMZ_mXIP5Q",
        "Title": "Revisiting Should the Market Cross in Kells, Co. Meath be moved? Ireland 1967",
        "Description": "Should the Market Cross in Kells in County Meath be moved from its present position?\n\nKells in County Meath has five crosses, the earliest from around the 8th century, the latest from the 10th or 11th century. Four of the crosses are in or near the graveyard of Saint Columbas Church, Kells. The fifth, a sandstone high cross known as the Market Cross, stands at the heart of the town in the centre of a complex road system.\n\nNo one can say for certain that it always stood here.\n\nIt is generally accepted the cross has been moved on a number of occasions. It has been at its present position at the junction of Market Street, Castle Street and John’s Street since 1688.\n\nThe Kells Tidy Town committee is advocating for the removal of Market Cross to a less prominent position. Patrick Skelly would like to see the cross moved and points to three reasons for this viewpoint. The main one is because the cross is a traffic hazard. He is worried the cross could be damaged which he believes will reflect badly on the Kells Tidy Town committee. He also points out the cross is not in its original position as it is facing north to south,\n\nAll those crosses when they were first erected were erected east to west.\n\nTo preserve the monument and facilitate the study of its sculpture, he would like to see the cross moved to the grounds of Saint Colmcille’s Church, Kells.\n\nThe people of Kells have differing views regarding the location of the cross. Some believe the cross is creating traffic problems. Others think its removal would make traffic worse. Many want the cross to be left alone. One man thinks,\n\nThe cross would lose its identity if it were shifted elsewhere.\n\nPatrick Skelly is adamant the cross should be moved and would like to see the county council take responsibility for the relocation.\n\n‘Newsbeat’ was a half-hour feature programme presented by Frank Hall and ran for seven years from September 1964 to June 1971. ‘Newsbeat’ went out from Monday to Friday on RTÉ television and reported on current affairs and issues of local interest from around Ireland.\n\nThis episode of ‘Newsbeat’ was broadcast on 7 March 1967. The reporter is Cathal O’Shannon.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-09-19 23:31:30"
    },
    {
        "Label": 9,
        "Video URL": "https://www.youtube.com/watch?v=pfdk_xAu_cY",
        "Title": "Revisiting Michael D Higgins",
        "Description": "A profile of the Labour Party Chairman Michael D Higgins.\n\nMichael D Higgins, a University College Galway (UCG) lecturer and former Senator succeeds Roddy Connolly as Chairman of the Labour Party. \n\nThe post of party chairman certainly carries prestige and status but it’s a position that pales beside the acquisition of those elusive that Higgins has sought after for almost ten years now, TD.\n\nComing from rural County Clare, Michael D Higgins came to Galway in 1960 as a clerk in the ESB. Two years later, he enrolled in UCG and excelled in his college career that brought him to the world of academia, now a lecturer in Sociology. \n\nMichael D Higgins recalls his feelings of isolation growing up in rural Clare with his aunt and uncle. \n\nHis involvement in party politics began with a brief term as chairman of UCG Fianna Fáil. He first ran as a Labour candidate in Galway West in 1969 gaining 1,100 votes and in 1973 he amassed over 5,000 votes. As the years passed his politics moved more to the left and he now feels that the next election must be make or break for him. He is opposed to coalitions and believes that the Labour Party has suffered by its involvement in government with Fine Gael.\n\nAs it had to cut back its socialist programme, it has lost membership. It lost, I think, a certain amount of credibility.\n\nMichael D Higgins believes that for the Labour Party to be successful it must show a commitment to unambiguous and practical policies. He points out that the appeal of socialism is in its rationality. \n\nThe nature of coalitions is that one loses one’s programme.\n\nHiggins believes that the Labour Party should have a single minded radical course with clear and practical policies around jobs, housing, health, environment and culture.\n\nThe Labour Party recently opened a centre overlooking Eyre Square in Galway, partly in an effort to garner support so that Higgins will secure a Dáil seat.\n\nIf anyone is to get a seat for Labour west of the Shannon, it would be Michael D\n\nThis episode of ‘PM’ was broadcast on 2 May 1978. The reporter is Nick Coffey.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-09-26 20:30:03"
    },
    {
        "Label": 10,
        "Video URL": "https://www.youtube.com/watch?v=bBL-V1Wrw_c",
        "Title": "Revisiting The Auld Triangle",
        "Description": "Paddy Reilly performs The Auld Triangle a cappella.\n\nBrendan Behan credited Dick Shannon for writing ‘The Auld Triangle’ a song about life in Mountjoy Prison in Dublin. The song features in ‘The Quare Fellow’ a play written by Brendan Behan in 1954.\n\nPaddy Reilly has been regarded as one of Ireland’s top folk singers for the past 20 years and has two huge hits to his credits - the haunting Phil Coulter number ‘The Town I Loved So Well’ and the poignant ‘Fields of Athenry’. He was recently given a gold disc for his album from this Festival Folk series - one of Ireland’s top selling albums in 1983.\n\nThis episode of ‘Festival Folk’ was broadcast on 11 January 1984.\n\n‘Festival Folk’ was a series of concerts recorded in the National Stadium, Dublin, featuring well-known folk singers and musicians. It ran from 1983 to 1984.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-10-03 12:05:44"
    },
    {
        "Label": 11,
        "Video URL": "https://www.youtube.com/watch?v=L2_4bBHz-EE",
        "Title": "Revisiting Hall’s Pictorial Weekly in Callan Town, Co. Kilkenny, Ireland 1974",
        "Description": "The people and the town of Callan are the stars of this opening sequence to ‘Hall’s Pictorial Weekly’.\n\nAmong the people going about their daily business are a farmer driving through the town on his tractor, workmen digging up the street and children playing.\n\nOnce a week from June to September, the ‘Hall’s Pictorial Weekly’ film crew would arrive at a town or village in any county in Ireland. They would film the people and the place and return to RTÉ where the footage was edited and put to music. The people of Cobh go about their daily business, unaware they are being filmed.\n\nThis short film of around one minute’s duration formed part of the opening sequence for that week’s episode. As it was not advertised as part of the programme billings in the RTÉ Guide or newspapers, people watched in the hope it was the turn of their town or village to have its moment of fame.\n\nFrank Hall’s amusing and satirical series began on 29 September 1971 with the full title ‘Hall’s Pictorial Weekly Incorporating the Provincial Vindicator’ which became known as ‘Hall’s Pictorial Weekly’.\n\nThe series allowed Frank Hall to follow his interest in the lives of viewers throughout the country.\nRegarded as RTÉ’s flagship comedy show, it featured satirical sketches on current news stories and popular culture, as well as parody songs, comedy sketches, re-edited videos, cartoons and spoof television formats. The show ran for nine series until 1980.\n\nThis episode of ‘Hall’s Pictorial Weekly’ was broadcast on 2 May 1974.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-10-10 08:07:14"
    },
    {
        "Label": 12,
        "Video URL": "https://www.youtube.com/watch?v=w4i2WbZ91yg",
        "Title": "Revisiting Ireland U18 Football Team are the Champions of Europe, 1998",
        "Description": "Under 18 Champions Celebrate In Cyprus\n\nThe Under 18 squad celebrate a second under age European soccer title for the Republic of Ireland in the same year.\n\nA momentous year for Irish football, with both the Under 16 and Under 18 sides winning the European Championship titles.\n\nThe day following the Republic of Ireland Under 18 side beat Germany in the final, the squad relaxed by the pool in Cyprus.\n\nPenalty shootout hero Liam George describes what it was like to take that crucial spot kick with the full support of the Irish team and fans. \nEighteen-year-old Robbie Keane is at a loss for words to describe the secret to Brian Kerr’s success. \n\nNobody would ever think that Ireland could win two European Championships in the one year. To be honest with you, I can’t really say how he does it.\n\nTeam Manager Brian Kerr has taken time out to think about his side’s success.\n\nI had a good little laugh to myself. The idea that Ireland had won both of the European Youth Championships.\n\nFor Brian Kerr, the victory is down to the players.\n\nAn RTÉ News report broadcast on 27 July 1998. The reporter is Clare McNamara.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-10-17 22:28:22"
    },
    {
        "Label": 13,
        "Video URL": "https://www.youtube.com/watch?v=-ZvHpOUnVW8",
        "Title": "Revisiting Hall’s Pictorial Weekly in Bruree, Co. Limerick, Ireland 1974",
        "Description": "The People and Village of Bruree are the stars of this opening sequence for ‘Hall’s Pictorial Weekly’.\n\nBruree, (in Irish Brú Rí meaning ‘(the) Abode of Kings’) is situated on the river Maigue in South County Limerick. It served as an alternative seat for the Kings of Munster from ancient times until the end of the twelfth century. The Irish bardic poets met here twice a year up until 1746.\n\nIn modern times, the best known person from Bruree is Éamon de Valera. Born in the United States he was brought back here by his mother at the age of three, and was raised by his grandmother, aunt and uncle.\n\nTractors seem to be the main vehicles passing through the village today, and the bus to Cork city makes a stop. Two local men taking a cigarette break look over at the camera, while one lady who has been shopping heads home with her groceries.\n\nThis episode of ‘Hall’s Pictorial Weekly’ was broadcast on 17 January 1974.\n\nOnce a week, from June to September, the ‘Hall’s Pictorial Weekly’ film crew would arrive at a town or village in any county in Ireland. They would film the people and the place and return to RTÉ where the footage was edited and put to music.\n\nThis short film of around one minute’s duration formed part of the opening sequence for that week’s episode. But no-one knew which location had been chosen, and it was not advertised as part of the programme billings in the RTÉ Guide or newspapers.\n\nSo with this in mind, people the length and breadth of the country tuned in religiously, in case it was the turn of their town or village to have its few minutes of fame.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-10-24 05:52:58"
    },
    {
        "Label": 14,
        "Video URL": "https://www.youtube.com/watch?v=lTBLQh06XfY",
        "Title": "Revisiting Learning Irish via Outdoor Activities, Falcarragh, Co. Donegal, Ireland 1981",
        "Description": "Young people take an Irish course with a difference with Eachtra in the Falcarragh Gaeltacht in Donegal.\n\nIn 1970 Gael Linn established Eachtra, adventure courses for Irish speaking teenagers. The scheme does not teach Irish, but instead provides instruction for adventure sports such as kayaking, sailing, orienteering and rock climbing through the Irish language.\n\nMost of the Eachtra courses take place in the Gaeltacht. The RTÉ young people’s programme, ‘Off The Wall’ visits Falcarragh in Donegal to film a group of young people undertaking some Eachtra activities in the region. The teenagers on the course are from all parts of Ireland and are ready for the mountains, sea and craic.\n\nThe Eachtra group are out in the wilds of Donegal where they plan to follow a trail past Aghla More to Aghla Beg. On this hike, they will experience great views of Errigal and other mountains in the area. There is no need to worry about bus strikes or traffic jams in this idyll.\n\nSuaimhneas agus and síocháin.\n\nThe poor weather does not bother the intrepid hikers. They reach Loch Altan a lake situated at the foot of the northern slopes of Errigal. One of the group says the place lives up to her expectations. At their journey’s end the students have views of Errigal, Muckish and in the distance, the sea. The group then try canoeing on a river in Dunlewey.\n\nThis episode of ‘Off The Wall’ was broadcast on 27 July 1981.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-10-31 12:28:06"
    },
    {
        "Label": 15,
        "Video URL": "https://www.youtube.com/watch?v=kPDwwF6GeEU",
        "Title": "Revisiting Hall’s Pictorial Weekly in Athleague, Co. Roscommon, Ireland 1978",
        "Description": "The people and village of Athleague are the stars of this opening sequence for ‘Hall’s Pictorial Weekly’.\n\nThe village of Athleague (Áth Liag as Gaeilge, meaning ‘stony ford’ ) is located on the River Suck, approximately ten kilometres outside Roscommon town.\n\nWhen ‘Hall’s Pictorial Weekly’ production crew visit Athleague farmers are going about their business, children are on their way home from school, and one lady has just posted a letter.\n\nThis episode of ‘Hall’s Pictorial Weekly’ was broadcast on 15 March 1978.\n\nOnce a week, from June to September, the ‘Hall’s Pictorial Weekly’ film crew would arrive at a town or village in any county in Ireland. They would film the people and the place and return to RTÉ where the footage was edited and put to music.\n\nThis short film of around one minute’s duration formed part of the opening sequence for that week’s episode. But no-one knew which location had been chosen, and it was not advertised as part of the programme billings in the RTÉ Guide or newspapers.\n\nSo with this in mind people the length and breadth of the country tuned in religiously, in case it was the turn of their town or village to have its few minutes of fame.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nJoin us as we take a nostalgic journey back to this iconic moment in history. Don't forget to like, comment, and subscribe for more classic memories from the Vintage Archive.\n\nFor any concerns or issues regarding the video, please contact us at vintagearchivecontact@gmail.com.\n\nFor any Copyright issues, please reach out to us first before filing a claim with YouTube. Send us a message or email detailing your concerns and we'll make sure the matter is resolved immediately. All contact details in our channel's \"About\" page! Please consider \"fair use\" before filing a claim. Thank You!",
        "Tags": [
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane",
            "vintage archive",
            "history",
            "nostalgia",
            "vintage",
            "retro",
            "classic moments",
            "documentary",
            "throwback",
            "old footage",
            "heritage",
            "memory lane"
        ],
        "schedule": "2024-11-07 11:16:25"
    }
]