[
    {
        "Label": 2,
        "Video URL": "https://www.youtube.com/watch?v=121VjkLydh0",
        "Title": "Bubbling Over (1934) [Comedy]",
        "Description": "\"Bubbling Over\" is a 1934 American musical comedy short film directed by Leigh Jason.\n\nSamson Peabody is the janitor in an apartment building where he and his wife Ethel live with a large crowd of Samson's freeloading relatives. When more relatives come to stay, Ethel throws them out. A scheming occupant of the building reads Samson's mail and poses as a clairvoyant prediciting the events of the letter; the arrival of Samson's rich Uncle for dinner. However, the Uncle is a penniless lunatic (imagining himself to be The Emperor Jones) and a pickpocket. He steals the chicken of the dinner, several watches of the guests, the clairvoyant's crystal ball and in the final scene, all the clothes of the people in the room.\n\n---\n\nDirected by Leigh Jason, produced by Meyer Davis (associate producer) and Monroe Shaff (producer), written by Burnet Hershey, starring Ethel Waters as Ethel Peabody, Southernaires Quartet as Some Relatives, Hamtree Harrington as Presbee Peabody and Frank L. Wilson as Swami River.\n\n---\n\n\nSource: \"Bubbling Over (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 20 July 2012. http://en.wikipedia.org/wiki/Bubbling_Over_(1934_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Bubbling Over",
            "Bubbling",
            "Over",
            "Comedy",
            "Film",
            "Movie",
            "1934",
            "Uncle",
            "Dinner",
            "Funny",
            "Family",
            "Crystal",
            "Ball",
            "Humour (Literary Genre)",
            "Clothes",
            "Parody",
            "Leigh Jason",
            "Meyer Davis",
            "Monroe Shaff",
            "Burnet Hershey",
            "Ethel Waters",
            "Southernaires Quartet",
            "Hamtree Harrington",
            "Frank L. Wilson",
            "Spoof",
            "Friends"
        ]
    },
    {
        "Label": 3,
        "Video URL": "https://www.youtube.com/watch?v=oZsq52_-rz0",
        "Title": "The Front Page (1931) [Comedy]",
        "Description": "\"The Front Page\" is a 1931 American comedy film, directed by Lewis Milestone and starring Adolphe Menjou and Pat O'Brien. Based on a Broadway play of the same name, the film was produced by Howard Hughes, written by Bartlett Cormack and Charles Lederer, and distributed by United Artists. The supporting cast includes Mary Brian, George E. Stone, Matt Moore, and Edward Everett Horton. At the 4th Academy Awards, the film was nominated for Best Picture, Milestone for Best Director, and Menjou for Best Actor.\n\nThe film, considered a screwball comedy, centers on an investigative reporter (Pat O'Brien) and his editor (Adolphe Menjou), who hope to cash in on a big story involving an escaped accused murderer (Stone) and hide him in a rolltop desk while everybody else tries to find him.\n\n---\n\nDirected by Lewis Milestone, produced by Lewis Milestone and Howard Hughes, written by Bartlett Cormack and Charles Lederer, starring Adolphe Menjou, Pat O'Brien and Mary Brian.\n\n---\n\nSource: \"The Front Page (1931 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 12 July 2012. Web. 20 July 2012. http://en.wikipedia.org/wiki/The_Front_Page_(1931_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "The Front Page",
            "Front",
            "Page",
            "1931",
            "Comedy (Film Genre)",
            "Film (Industry)",
            "Film",
            "Movie",
            "Full",
            "Comedy",
            "US",
            "Broadway",
            "Best Picture",
            "Best Director",
            "Best Actor",
            "TCM",
            "Murderer",
            "Lewis Milestone",
            "Howard Hughes",
            "Bartlett Cormack",
            "Charles Lederer",
            "Adolphe Menjou",
            "Pat O'Brien",
            "Mary Brian",
            "Hollywood",
            "Welcome",
            "Funny"
        ]
    },
    {
        "Label": 1,
        "Video URL": "https://www.youtube.com/watch?v=iNoG7NDOyc4",
        "Title": "Palooka (1934) [Comedy]",
        "Description": "Palooka is a 1934 comedy film directed by Benjamin Stoloff starring Jimmy Durante. It is based on the comic strip by Ham Fisher. The movie was adapted by Jack Jevne, Arthur Kober, Gertrude Purcell, Murray Roth and Ben Ryan from the comic strip. It was directed by Benjamin Stoloff. The film is also known as \"The Great Schnozzle\" in the United Kingdom. \n\nJoe Palooka (Stuart Erwin) is a naive young man whose father Pete (Robert Armstrong) was a champion boxer, but his lifestyle caused Joe's mother Mayme (Marjorie Rambeau) to leave him and to take young Joe to the country to raise him. But when a shady boxing manager (Jimmy Durante) discovers Joe's natural boxing talent, Joe decides to follow him to the big city, where he becomes a champion and begins to follow his father's path of debauchery, much of it including the glamorous cabaret singer Nina Madero (Lupe Vélez). The film also stars William Cagney, the younger brother of actor James Cagney.\n\n---\n\nDirected by Benjamin Stoloff, produced by Edward Small, written by Ham Fisher (comic strip), Jack Jevne (screenplay), Arthur Kober (screenplay), Gertrude Purcell (screenplay), Murray Roth (additional dialogue) and Ben Ryan (additional dialogue), starring Jimmy Durante as Knobby Walsh (Junior), Lupe Vélez as Nina Madero, Stuart Erwin as Joe Palooka, Marjorie Rambeau as Mayme Palooka and Robert Armstrong as Pete 'Goodtime' Palooka.\n\n---\n\nSource: \"Palooka (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 July 2012. Web. 22 July 2012. http://en.wikipedia.org/wiki/Palooka_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Palooka",
            "The Great Schnozzle",
            "Comedy (Film Genre)",
            "Film (Industry)"
        ]
    },
    {
        "Label": 5,
        "Video URL": "https://www.youtube.com/watch?v=WiAM1gr9BLc",
        "Title": "Made for Each Other (1939) [Comedy] [Drama] [Romance]",
        "Description": "John Mason is a young, somewhat timid attorney in New York City. He has been doing his job well, and he has a chance of being made a partner in his law firm, especially if he marries Eunice, the daughter of his employer, Judge Doolittle. However, John meets Jane during a business trip, and they fall in love and marry immediately. John's mother is disappointed with his choice, and an important court trial forces him to cancel the honeymoon. He wins the case, but by that time Judge Doolittle has chosen John's kowtowing coworker as the new partner.\n\nJane encourages John to demand a raise and a promotion, but with finances tightened by the Depression, Doolittle requires that all employees accept pay cuts. After Jane has a baby, John becomes discouraged by his unpaid bills and by tension between Jane and his mother, who lives with them in their small apartment.\n\nOn New Year's Eve, 1938--39, the baby is rushed to the hospital with pneumonia. The baby will die within hours unless a serum is delivered by plane from Salt Lake City. Doolittle agrees to provide funding to deliver the serum, but with a storm raging, and with a wife and children to consider, the pilot refuses to fly. John pleads over the telephone, and the pilot's unmarried friend takes the job. The new pilot almost crashes in the mountains, and the plane's engine catches fire a short distance from New York. The pilot is also injured and knocked unconscious after jumping from the plane and parachuting to safety, but he crawls to a nearby farm house after he comes to. The farmer sees the box containing the serum and telephones the hospital, and the baby is saved. A few years later, John is made partner at the law firm and his son has just spoken his first words.\n\n---\n\nDirected by John Cromwell, produced byDavid O. Selznick, written by Rose Franken (story)\nJo Swerling and Frank Ryan, starring Carole Lombard as Jane Mason, James Stewart as John Horace Mason, Charles Coburn as Judge Joseph M. Doolittle, Lucile Watson as Mrs. Harriet Mason (John Mason's mother) and Alma Kruger as Sister Madeline.\n\n---\n\nSource: \"Made for Each Other (1939 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 18 May 2013. Web. 15 July 2013. http://en.wikipedia.org/wiki/Made_for_Each_Other_(1939_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Made For Each Other (Film)",
            "Film (Invention)",
            "Comedy",
            "lawyer",
            "marriage",
            "pregnant woman",
            "pregnant",
            "soap opera",
            "Pregnancy (Disease Cause)",
            "new york city",
            "airplane accident",
            "prayer",
            "childbirth",
            "manhattan",
            "hospital",
            "movie",
            "film",
            "full",
            "James Stewart",
            "classic"
        ]
    },
    {
        "Label": 7,
        "Video URL": "https://www.youtube.com/watch?v=Wf_CB2RRWzk",
        "Title": "Meet John Doe (1941) [Comedy]",
        "Description": "\"Meet John Doe\" is a 1941 American comedy drama film directed and produced by Frank Capra, and starring Gary Cooper and Barbara Stanwyck. The film is about a \"grassroots\" political campaign created unwittingly by a newspaper columnist and pursued by a wealthy businessman. It became a box office hit and was nominated for an Academy Award for Best Story. Though the film is less well known than other Frank Capra classics, it remains highly regarded today. It was ranked #49 in AFI's 100 Years... 100 Cheers.\n\nInfuriated at being told to write one final column after being laid off from her newspaper job, Ann Mitchell (Barbara Stanwyck) prints a letter from a fictional unemployed \"John Doe\" threatening suicide on Christmas Eve in protest of society's ills. When the note causes a sensation and the paper's competition suspects a fraud and starts to investigate, the newspaper editor rehires Mitchell who comes up with a scheme of hiding the fictional nature of \"John Doe\" while exploiting the sensation caused by the fake letter to boost the newspaper's sales, for which she demands a bonus equal to 8 months' pay. After reviewing a number of derelicts who have shown up at the paper claiming to have penned the original suicide letter, Mitchell and editor Henry Connell (James Gleason) hire John Willoughby (Gary Cooper), a former baseball player and tramp who is in need of money to repair his injured arm, to play John Doe. Mitchell now starts to pen an article series in Doe's name, elaborating on the letter's ideas of society's disregard of people in need.\n\nWilloughby gets $50, a new suit of clothes, and a plush hotel suite with his tramp friend (Walter Brennan), who launches into an extended diatribe against \"the heelots\", lots of heels who incessantly focus on getting money from others. Willoughby is hired to give radio speeches, guided by Mitchell who is promised $100 a week to write his speeches, paid by the newspaper's publisher, D.B. Norton (Edward Arnold). Willoughby turns down a $5,000 bribe to admit the whole thing was a publicity stunt, gives Mitchell's speech, and dashes off to the countryside with \"The Colonel\". They ride the rails, playing the harmonica and ocarina until they show up in Millsville, where John Doe is recognized at a diner. He's brought to City Hall, where he's met by Hanson, who gives a five-minute monologue about how he was inspired to start a local John Doe club.\n\nThe John Doe philosophy spreads across the country, developing into a broad grassroots movement whose simple slogan is, \"Be a better neighbor\". Far from being an altruistic philanthropist, however, Norton plans to channel the support for Doe into support for his own national political ambitions. As a culmination of this plan, Norton has instructed Mitchell to write a speech for Willoughby in which he announces the foundation of a new political party and endorses Norton as its presidential candidate.\n\nWhen Willoughby, who has come to believe in the John Doe philosophy himself, realizes that he is being used, he tries to expose the plot, but is first stymied in his attempts to talk his own mind to a nationwide radio audience at the rally instead of reading the prepared speech, and then exposed as a fake by Norton, who claims to have been deceived, like everyone else, by the staff of the newspaper. Frustrated by his failure, Willoughby intends to commit suicide by jumping from the roof of the City Hall on Christmas Eve, as indicated in the original John Doe letter. Only the intervention of Mitchell and followers of the John Doe clubs persuades him to renege on his threat to kill himself. At this point in the movie, a reference to Jesus Christ is made, that a historical \"John Doe\" has already died for the sake of humanity. The film ends with Connell turning to Norton and saying, \"There you are, Norton! The people! Try and lick that!\"\n\n---\n\nProduced and directed by Frank Capra, written by Richard Connell and Robert Presnell, Sr., starring Gary Cooper and Barbara Stanwyck.\n\n---\n\nSource: \"Meet John Doe\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 18 July 2012. Web. 29 July 2012. http://en.wikipedia.org/wiki/Meet_John_Doe.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Meet John Doe",
            "War",
            "Meet",
            "John",
            "Doe",
            "Frank Capra",
            "Gary Cooper",
            "Barbara Stanwyck",
            "Grassroots",
            "Political",
            "Campaign",
            "Christmas",
            "Eve",
            "Christmas Eve (Holiday)",
            "Investigation",
            "Film",
            "Movie",
            "Full",
            "TCM",
            "Classical",
            "1941"
        ]
    },
    {
        "Label": 6,
        "Video URL": "https://www.youtube.com/watch?v=s18H0kSp1Fk",
        "Title": "The Man Who Walked Alone (1945) [Drama] [Comedy]",
        "Description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"The Man Who Walked Alone\" is a 1945 American film directed by Christy Cabanne.\n\nMarion Scott, honorably discharged WW II soldier, in \"civies\" and carrying a suitcase containing his uniform and medals, is hitch-hiking to the small hometown of a buddy killed overseas, intending to make it his home. En-route, he encounters wealthy society girl Wilhelmina Hammond, who is running away from her stuffed-shirt fiancée, Alvin Bailey and has taken his car without permission. Marion and Wilhelmina are bickering over a blow-out and an empty gas tank when the local cops appear and haul them off to jail on a car-theft charge. Wilhelmina establishes her identity and is released and, intrigued by Marion whom she suspects is a deserter, arranges his release also. She takes him to the Hammond estate and tells Marion, who does not know her true identity, she is Mrs. Hammond's secretary. Wilhelmina has no keys to the home and they are arrested again when they are caught crawling into the house through a window. This time reporters and photographers discover her identity and plaster the papers with a story of an heiress running out on her rich fiancée to take up with an unknown stranger. Over the objections of the Hammond caretaker, Wiggins, she hires Marion as a chauffeur and stands her ground when her irate mother and angry fiancée rush home from New York with their entourage, including: Aunt Harriet, an old maid who had an unfortunate love affair during WW I; Patricia, \"Willie's\" young and mischievous sister; Camille, the family dressmaker, and Champ, Alvin's physical instructor. It becomes a battle of wills as Mrs. Hammond and Alvin are determined to break up a romance that doesn't exist, as \"Willie\" and Marion are constantly bickering, and Aunt Harriet who is all for the pair getting together.\n\n---\n\nDirected by Christy Cabanne, produced by Christy Cabanne (associate producer) and Leon Fromkess (producer), written by Christy Cabanne (original screenplay) and Robert Lee Johnson (screenplay), starring Dave O'Brien as Cpl. Marion Scott, Kay Aldridge as Wilhelmina Hammond, Walter Catlett as Wiggins, Guinn 'Big Boy' Williams as Champ. Isabel Randolph as Mrs. Hammond and Smith Ballew as Alvin Bailey.\n\n---\n\nSource: \"The Man Who Walked Alone\" IMDb, Internet Movie Database. Written by Les Adams. Web. 15 July 2012. http://www.imdb.com/title/tt0037893/plotsummary.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "The",
            "Man",
            "Who",
            "Walked",
            "Alone",
            "1945"
        ]
    },
    {
        "Label": 8,
        "Video URL": "https://www.youtube.com/watch?v=ObOS_XSMpso",
        "Title": "Indiscreet (1931) [Comedy]",
        "Description": "\"Indiscreet\" is an American comedy film directed by Leo McCarey and starring Gloria Swanson and Ben Lyon. The screenplay by Buddy G. DeSylva, Lew Brown, and Ray Henderson, based on their story Obey That Impulse, originally was written as a full-fledged musical, but only two songs - \"If You Haven't Got Love\" and \"Come to Me\" - remained when the film was released.\n\nThe plot of the United Artists release centers on fashion designer Geraldine Trent (Swanson), who takes up with novelist Tony Blake (Lyon) after leaving her former beau Jim Woodward because of his many indiscretions with other women. Tony has indicated he has no interest in dating a woman with a past, so Geraldine remains mum about her affair with Jim, until her younger sister Joan arrives and announces she's engaged—to Jim. Madcap complications ensue as Geraldine tries to keep her secret from Tony while convincing her sister to rid herself of her womanizing fiancé in favor of simple country boy Buster Collins.\n\n---\n\nDirected by Leo McCarey, produced by Lew Brown, Buddy G. DeSylva and Ray Henderson, written by Buddy G. DeSylva (story & scenario), Lew Brown (story & scenario), Ray Henderson (story & scenario) and Leo McCarey, starring Gloria Swanson\nand Ben Lyon.\n\n---\n\nSource: \"Indiscreet (1931 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 29 July 2012. http://en.wikipedia.org/wiki/Indiscreet_(1931_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Indiscreet",
            "Comedy (Film Genre)",
            "Leo McCarey",
            "Gloria Swanson",
            "Ben Lyon",
            "Buddy G. DeSylva",
            "Lew Brown",
            "Ray Henderson",
            "1931",
            "If You Haven't Got Love",
            "and",
            "Come to Me",
            "Fashion",
            "Designer",
            "Indiscretion",
            "Film (Industry)"
        ]
    },
    {
        "Label": 10,
        "Video URL": "https://www.youtube.com/watch?v=u9hTxzLHU3I",
        "Title": "As You Like It (1936) [Drama] [Comedy]",
        "Description": "\"As You Like It\" is a 1936 film, directed by Paul Czinner and starring Laurence Olivier as Orlando and Elisabeth Bergner as Rosalind. It is based on William Shakespeare's play of the same name. It was Laurence Olivier's first performance of Shakespeare on screen.\n\nIt was the final film of stage actors Leon Quartermaine and Henry Ainley, and featured an early screen role for Ainley's son Richard as Sylvius, as well as for John Laurie, who played Orlando's brother Oliver. (Laurie would go on to co-star with Olivier in the three Shakespeare films that Olivier directed.) Bergner had previously played the role of Rosalind in her native Germany and her German accent is apparent in most of her scenes.\n\nDuke Frederick (Felix Aylmer) has usurped and deposed his older brother, Duke Senior (Henry Ainley). Frederick allows the exiled Duke's daughter, Rosalind (Elisabeth Bergner), however, to stay, as she is the closest friend of his daughter, Celia (Sophie Stewart). Orlando (Laurence Olivier), who has been forced to flee his home due to the oppression from his brother, Oliver (John Laurie), comes to the Frederick's Duchy, and enters a wrestling tournament. On leaving the Duchy, Orlando encounters Rosalind, and it is love at first sight. Frederick then becomes angry, and banishes Rosalind. Celia decides to accompany her, along with a jester, Touchstone (Mackenzie Ward).\n\nRosalind and Celia disguise themselves as \"Ganymede\", a boy, and \"Aliena\", respectively, and venture into the Forest of Arden, where they eventually encounter the exiled Duke. Orlando, who discovers that Rosalind is now living with the Duke, posts love poems on the trees for her. Orlando manages to come across Ganymede, who proceeds to teach Orlando how to cure love. At the same time, Phoebe (Joan White), a shepherdess, falls in love with Ganymede, though he (she) continually rejects her. Sylvius (Richard Ainley), a shepherd, is in love with Phoebe, which complicates the matter. Meanwhile, Touchstone attempts to marry the simple farmgirl, Audrey (Dorice Fordred), before he can be stopped by Jaques (Leon Quartermaine), a Lord who lives with the exiled Duke.\n\nEventually, Ganymede, Orlando, Phoebe, and Silvius are brought together to sort out who marries whom. Ganymede proposes that Orlando promise to marry Rosalind, and Phoebe promise to marry Silvius if she cannot marry Ganymede. The next day, Rosalind reveals herself, and Phoebe is married to Silvius. Orlando then rescues Oliver from a lioness in the forest, causing Oliver to repent and re-embrace his brother. Orlando and Rosalind, Oliver and Celia, Silvius and Phoebe, and Touchstone and Audrey are all then married, and they learn that Frederick has also repented and decided to reinstate his brother as the Duke.\n\n---\n\nDirected and produced by Paul Czinner, written by William Shakespeare, J. M. Barrie (treatment) and R. J. Cullen (scenario), starring Laurence Olivier, Elisabeth Bergner, Felix Aylmer, Henry Ainley and Sophie Stewart.\n\n---\n\nSource: \"As You Like It (1936 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 24 July 2012. Web. 30 July 2012. http://en.wikipedia.org/wiki/As_You_Like_It_(1936_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "As You Like It",
            "Comedy (TV Genre)",
            "Drama (Award Discipline)",
            "Drama",
            "Comedy",
            "Film",
            "Full",
            "Movie",
            "Paul Czinner",
            "William Shakespeare",
            "Laurence Olivier",
            "Elisabeth Bergner",
            "Felix Aylmer",
            "Henry Ainley",
            "Sophie Stewart"
        ]
    },
    {
        "Label": 12,
        "Video URL": "https://www.youtube.com/watch?v=UAjwD_e4mQI",
        "Title": "Q Planes (1939) [Comedy] [Thriller]",
        "Description": "\"Q Planes\" (1939) released in the United States by Columbia Pictures as \"Clouds Over Europe\", is a British spy film directed by Tim Whelan and Arthur B. Woods, starring Ralph Richardson, Laurence Olivier and Valerie Hobson. The film was produced by Irving Asher with Alexander Korda as executive producer. The name \"Q Planes\" may have been derived from the British \"Q-ships\" that were used as spy and armed merchant vessels in the First World War. The film was helmed by American director Tim Whelan (Sidewalks of London (1938) and later, in 1940, co-director of The Thief of Bagdad) who was then in Britain working for Korda at Denham Studios.\n\n\"Q Planes\" (or in its American guise, \"Clouds Over Europe\") mixes the genres of spy thriller and comedy romance, and was intended to be a star vehicle for Olivier, but Richardson dominates much of the screen with a sardonic take on a spy, either working for Scotland Yard or British Military Intelligence. Released just months before the United Kingdom declared war on Germany in 1939, the film is a precursor to the \"strongly nationalistic, anti-German films that would reach their zenith in Britain during the war years\".\n\nAdvanced British aircraft prototypes carrying experimental and highly secret equipment being developed under government contract, are regularly vanishing with their crews on their test flights. No one can deduce the problem, not even spymaster Major Hammond (Ralph Richardson) or his sister Kay (Valerie Hobson), a newspaper reporter who is working undercover in the works canteen used by the crews at the Barrett & Ward Aircraft Company.\n\nAt first, Major Hammond is seen as an outsider at the aircraft factory, even by Mr. Barrett, the owner (George Merritt), but he soon finds a friend in a star pilot, Tony McVane (Laurence Olivier) who helps him try to unravel the case. Hammond becomes convinced that the company secretary at the factory, Jenkins (George Curzon) is a foreign agent and \"mole\", but Jenkins is killed by unseen gunmen before he can give up the names of his contacts.\n\nThe mystery remains unsolved when McVane returns to the aircraft factory, determined to make the next test flight. His aircraft, like the others, is brought down by a powerful ray beamed from the S.S. Viking, a mysterious salvage ship manned by a foreign crew. Along with his aircraft, McVane and his flight crew are taken hostage on the ship, where he discovers many other missing airmen have suffered the same fate. Gathering up weapons, McVane leads the British survivors in an attempt to take control of the ship. Major Hammond learns the truth and directs a Royal Navy ship (HMS Echo) to come to their rescue. In a short coda, Kay and McVane get together and Hammond learns, to his chagrin, that his longtime lady friend has married.\n\n--- \n\nDirected by Tim Whelan and Arthur B. Woods, produced by Irving Asher (producer) and Alexander Korda (executive producer), written by Brock Williams, Jack Whittingham and Ian Dalrymple, starring Ralph Richardson, Laurence Olivier and Valerie Hobson.\n\n---\n\nSource: \"Q Planes\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 May 2012. Web. 3 August 2012. http://en.wikipedia.org/wiki/Q_Planes.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Q Planes",
            "Comedy",
            "Movie",
            "Full",
            "Thriller (genre)",
            "Drama",
            "Film (Invention)",
            "Ralph Richardson",
            "Laurence Olivier",
            "Valerie Hobson",
            "Plane",
            "War",
            "Germany",
            "Britain"
        ]
    },
    {
        "Label": 9,
        "Video URL": "https://www.youtube.com/watch?v=Zie8JQl6OBE",
        "Title": "A Bride for Henry (1937) [Comedy]",
        "Description": "\"A Bride for Henry\" is a 1937 American film directed by William Nigh. When Sheila Curtis' (Anne Nagel) fiancé doesn't show up for the wedding, she drafts her lawyer, Henry Tuttle (Warren Hull), to stand in for the missing groom.\n\nWhen Eric Reynolds (Henry Mollison) finally shows up, after sleeping off the bachelor party, Shelia intends to get a quick divorce, and marry him, after the media attention dies down. Although, Henry has been in love with her for years, he gets fed up, and spends his time, on their \"Honeymoon\" with his old girlfriend, wealthy Helen Van Orden (Claudia Dell), and a bevy of beauties. Shelia soon gets jealous; and, realizes that Eric will always be unreliable; while, it's Henry she's always counted on, and loved; but, it might be too late. She might have taken Henry for granted for too long.\n\n---\n\nDirected by William Nigh, produced by Dorothy Davenport, screenplay by Marion Orth, story by Josephine Bentham, starring Anne Nagel as Sheila Curtis, Warren Hull as Henry Tuttle, Henry Mollison as Eric Reynolds, Claudia Dell as Helen Van Orden, Betty Ross Clarke as Mrs. Curtis and Harrison Greene as Constable.\n\n---\n\nSource: \"A Bride for Henry\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 25 July 2012. Web. 30 July 2012. http://en.wikipedia.org/wiki/A_Bride_for_Henry.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "A Bride for Henry",
            "Comedy (TV Genre)",
            "1937",
            "Bride (Literature Subject)",
            "Comedy",
            "Henry Mollison",
            "Claudia Dell",
            "Anne Nagel",
            "Warren Hull",
            "William Nigh",
            "Film",
            "Full",
            "Movie"
        ]
    },
    {
        "Label": 11,
        "Video URL": "https://www.youtube.com/watch?v=Cdct9Ihlff8",
        "Title": "The Animal Kingdom (1932) [Drama] [Comedy]",
        "Description": "\"The Animal Kingdom\" (also known as The Woman in His House in the UK) is a 1932 American comedy-drama film directed by Edward H. Griffith based upon a comedy of manners of the same name by Philip Barry. The film starred Leslie Howard, Ann Harding, Myrna Loy, William Gargan, Ilka Chase, and Neil Hamilton. Howard, Gargan, and Chase also starred in the play when it opened on Broadway on 12 January 1932.\n\nThe film is based on a play, of the same name, set in 1930's New York and Connecticut. Tom Collier, Leslie Howard, is a book publisher, who has been living in the city with his best friend, Daisy Sage, Ann Harding, without being married. His wealthy Father, Rufus Collier, Henry Stephenson, wants him to live a respectable life. While Daisy is away, with her work, Cecilia, Myrna Loy, convinces Tom to marry her. Although, their lawyer and friend, Owen, Neil Hamilton, is in love with her; he doesn't have enough financial resources to maintain her interest. Cecilia tries to get Tom to \"sell out\", without his realizing it. She talks him into publishing books that will make money, get rid of his old friends, including \"Red\", his prize-fighter friend and butler. She wants Tom to sell his publishing company, live in the city, with his Father, as a \"proper gentleman\", and take their place in society, which Tom has been fighting all his life; but, is all \"Cee\" cares about.\n\nDaisy tries to stay away; but, she and Tom's Bohemian friends can't believe he's happy. She loves him deeply, and wants to have children with him; but, cares most about his well-being. Tom complains that he's losing his soul and integrity. Finally, when Cee offers Tom champagne, to toast selling his publishing company and moving in with his Father, Tom realizes that Cee's bedroom suite reminds him of a brothel he used to go, as he says, \"in vino veritas\". When Red tells Tom he is going back to the city, that he can't stomach anymore, Tom agrees, saying, he's \"going back to his wife,\" Daisy.\nAs he leaves, he put a little something on the mantle for Cee, just as he used to, with the girls, in the bordello.\n\n---\n\nDirected by Edward H. Griffith and George Cukor, produced by David O. Selznick, written by Philip Barry (play), Horace Jackson (screenplay), Edward H. Griffith, Adela Rogers St. Johns, starring Leslie Howard, Ann Harding and Myrna Loy.\n\n---\n\nSource: \"The Animal Kingdom\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 July 2012. Web. 30 July 2012. http://en.wikipedia.org/wiki/The_Animal_Kingdom.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "The Animal Kingdom",
            "1932",
            "Comedy (TV Genre)",
            "Drama (Award Discipline)",
            "Full",
            "Movie",
            "Film",
            "Drama",
            "Comedy",
            "Edward H. Griffith",
            "Leslie Howard",
            "Ann Harding",
            "Myrna Loy"
        ]
    },
    {
        "Label": 13,
        "Video URL": "https://www.youtube.com/watch?v=DxlckL8SS0s",
        "Title": "Tangled Destinies (1932) [Adventure] [Comedy]",
        "Description": "\"Tangled Destinies\" is a 1932 American film directed by Frank R. Strayer. The film is also known as \"Who Killed Harvey Forbes?\" in the United Kingdom. \n\n---\n\nDirected by Frank R. Strayer, produced by Ralph M. Like, written by Edward T. Lowe Jr. (story and adaptaion), starring Gene Morgan as Capt. Randall \"Randy\" Gordon, Doris Hill as Doris, Glenn Tryon as Tommy Preston, the Co-pilot, Vera Reynolds as Ruth (the Airline Stewardess), Ethel Wales as Prudence Daggott, Monaei Lindley as Monica van Buren, Syd Saylor as Buchanan (the Prizefighter), Sidney Bracey as McGinnis (posing as Professor Marmont), Lloyd Whitlock as Floyd Martin, James B. Leong as Ling, William P. Burt as Harvey Forbes, Henry Hall as Dr. Wingate (the Parson) and William Humphrey as Professor Hartley.\n\n---\n\nSource: \"Tangled Destinies\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 January 2012. Web. 3 August 2012. http://en.wikipedia.org/wiki/Tangled_Destinies.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Tangled Destinies",
            "Who Killed Harvey Forbes?",
            "1932",
            "Adventure (Comic Book Genre)",
            "Comedy (TV Genre)",
            "Full",
            "Movie",
            "Frank R. Strayer",
            "Airplane",
            "Comedy",
            "Crime",
            "Action"
        ]
    },
    {
        "Label": 4,
        "Video URL": "https://www.youtube.com/watch?v=_PnvIIyV9Fw",
        "Title": "Behave Yourself! (1951) [Comedy] [Crime]",
        "Description": "Behave Yourself! is a 1951 American film directed and co-written by George Beck, starring Farley Granger and Shelley Winters, and released by RKO Radio Pictures. The movie is about Bill (Farley Granger), who  forgets about his anniversary, with Kate (Shelley Winters) until the last minute, when a small dog starts to follow him. From there, mayhem ensues, knocking things over. Bill is chased by the police, smugglers, counterfeiters, and murderers, as well as harangued by his mother-in-law.\n\n---\n\nDirected by George Beck, produced by Norman Krasna, Stanley Rubin and Jerry Wald, written by George Beck and Frank Tarloff, starring Farley Granger as William Calhoun 'Bill' Denny, Shelley Winters as Kate Denny, William Demarest as Officer O'Ryan, Francis L. Sullivan as Fat Freddy, Margalo Gillmore as Mother, Lon Chaney Jr. as Pinky, Hans Conried as Gillie the Blade, Elisha Cook Jr. as Albert Jonas, Glenn Anders as Pete the Pusher, Allen Jenkins as Plainclothesman,, Sheldon Leonard as Shortwave Bert, Marvin Kaplan as Max the Umbrella, Archie as Himself and Henry Corden as Numi\n\n---\n\nSource: \"Behave Yourself!\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 27 September 2016. Web. 10 December 2016. https://en.wikipedia.org/wiki/Behave_Yourself!\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Behave Yourself!",
            "Behave Yourself",
            "Film",
            "full movie",
            "crime",
            "comedy",
            "Farley Granger",
            "Shelley Winters"
        ]
    },
    {
        "Label": 14,
        "Video URL": "https://www.youtube.com/watch?v=OUlSUCk61ZQ",
        "Title": "The Rage of Paris (1938) [Comedy]",
        "Description": "\"The Rage of Paris\" is a 1938 American comedy film made by Universal Pictures. The movie was directed by Henry Koster, and written by Bruce Manning and Felix Jackson. It won the Venice Film Festival for Special Recommendation.\n\n---\n\nDirected by Henry Koster, produced by Buddy G. DeSylva and Henry Koster, written by Bruce Manning, Felix Jackson, starring Danielle Darrieux as Nicole de Cortillon, Douglas Fairbanks Jr. as James 'Jim' Trevor, Mischa Auer as Mike Lebedovich, Louis Hayward as Bill (Jerome) Duncan, Helen Broderick as Gloria Patterson, Charles Coleman as Wrigley Trevor's Butler, Samuel S. Hinds as Mr. Duncan, Nella Walker as Mrs. Duncan and Harry Davenport as Pops, Caretaker.\n\n---\n\nSource: \"The Rage of Paris\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 10 February 2012. Web. 3 August 2012. http://en.wikipedia.org/wiki/The_Rage_of_Paris.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "The Rage of Paris",
            "Comedy (TV Genre)",
            "Paris (City/Town/Village)",
            "Henry Koster",
            "Full",
            "Movie",
            "Film",
            "Cinema",
            "Rage",
            "Full Filmmovie",
            "Free",
            "Watch"
        ]
    },
    {
        "Label": 16,
        "Video URL": "https://www.youtube.com/watch?v=5XBmIe3UPk0",
        "Title": "Lonely Wives (1931) [Comedy]",
        "Description": "Lonely Wives is a 1931 American comedy film directed by Russell Mack and starring Edward Everett Horton, Esther Ralston, and Laura La Plante. \n\nEdward Everett Horton plays Richard \"Dickie\" Smith, a respectable defence lawyer, for murder cases, who turns into an unfettered Don Juan, after the clock strikes 8 o'clock, in this Pre-Hays Code comedy. To fool his Mother-in-Law, Maude Eburne, as Mrs. Mantel, he hires famous vaudeville impersonator Felix, the Great Zero, played by Edward Everett Horton, in a double role, to stay at the house. While he goes out on the town, with his new, sultry secretary, Patsy Ruth Miller, as Kitty \"Minty\" Minter; and, his new client, Laura La Plante, as Diane O'Dare, unsuspecting that the husband she wants to divorce, for neglect, is actually Felix, the Great Zero, himself.\nWhen Esther Ralston, as Madeline Smith, returns early from her trip, Felix knows that the jig is up; or, is it.\n\nIt's a question of who's fooling who, which ends with an angry husband chasing them all with a loaded gun, an irate cabby looking for his fare, and a seemingly, flirtatious, fired, French maid. Meanwhile, Spencer Charters, as Andrews, the Butler, thinks he must have the DT's, seeing double of everyone. They know they'll reform their ways, if any of them survive the night.\n\n---\n\nDirected by Russell Mack, produced by E.B. Derr, written by Walter DeLeon and A.H. Woods (play), starring Edward Everett Horton as Richard \"Dickie\" Smith,, Esther Ralston as Madeline Smith, Laura La Plante as Diane O'Dare, Patsy Ruth Miller as Kitty \"Minty\" Minter, Spencer Charters as Andrews, the Butler, Maude Eburne as Mrs. Mantel and Maurice Black as Taxi Driver.\n\n---\n\nSource: \"Lonely Wives (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 9 January  2012. Web. 12 August 2012. http://en.wikipedia.org/wiki/Lonely_Wives_(film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Lonely",
            "Wives",
            "Comedy (TV Genre)",
            "Russell Mack",
            "Edward Everett Horton",
            "Esther Ralston",
            "Laura La Plante",
            "Don Juan",
            "Full",
            "Film",
            "Complete",
            "Television (Invention)"
        ]
    },
    {
        "Label": 21,
        "Video URL": "https://www.youtube.com/watch?v=-cHZI-5OkZQ",
        "Title": "St. Benny the Dip (1951) [Comedy]",
        "Description": "Benny (Dick Haymes), Monk (Lionel Stander) and Matthew (Roland Young) are three small-time crooks trying to escape a police dragnet in New York City. After hiding in a church and taking minister's suits and dog collars, they emerge, dressed as priests, and find shelter in an abandoned Bowery mission. When beat cops mistake them for real ministers sent to restore the soup kitchen, they're forced to go along with repairs, holding services and feeding the poor. They have to decide whether to stay, steal the mission money and run; or, change their lives. Like the Priest allowing Jean Valjean to escape, in Les Misérables, it's the first time they've been treated with respect, and had a chance to do some good work, for awhile. The question is whether the police detectives or junior priests will turn them in before they even have a chance.\n\n---\n\nDirected by Edgar G. Ulmer, produced by Edward J. Danziger and Harry Lee Danziger, written by George Auerbach (story) and John Roeburt (writer), starring Dick Haymes as Benny, Nina Foch as Linda Kovacs, Roland Young as Matthew, Lionel Stander as Monk Williams, Freddie Bartholomew as Reverend Wilbur, Oskar Karlweis as Mr. Kovacs, William A. Lee as Police Sergeant Monahan, Dick Gordon as Reverend Miles, Jean Casto as Mrs. Mary Williams, Eddie Wells as Patrolman McAvoy and James Bender as House Detective.\n\n---\n\nSource: \"St. Benny the Dip\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 25 March 2013. Web. 31 March 2013. http://en.wikipedia.org/wiki/St._Benny_the_Dip.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "St. Benny the Dip",
            "New York",
            "City",
            "Manhattan (US County)",
            "Les Misérables",
            "Manhattan Bridge (Bridge)",
            "police",
            "film",
            "movie",
            "full",
            "legal",
            "free",
            "Nyc",
            "Cops"
        ]
    },
    {
        "Label": 15,
        "Video URL": "https://www.youtube.com/watch?v=MYTeRiEKSEY",
        "Title": "So's Your Aunt Emma! (1942) [Comedy] [Crime]",
        "Description": "\"So's Your Aunt Emma!\" is a 1942 American film directed by Jean Yarbrough. The film is also known as \"Meet the Mob\". \n\n---\n\nDirected by Jean Yarbrough, Produced by Lindsley Parsons (producer) and Barney A. Sarecky (associate producer), written by George Bricker (writer), Edmond Kelso (writer) and Harry Hervey (story \"Aunt Emma Paints the Town\"), starring Zasu Pitts as Aunt Emma Bates, Roger Pryor as Terry Connors (Globe-Register Reporter), Warren Hymer as Joe Gormley (Hammond Goon), Douglas Fowley as Gus Hammond, Gwen Kenyon as Maris (Terry's Girl), Elizabeth Russell as Zelda Lafontaine, Tristram Coffin as Flower Henderson (Club Savoy Owner), Malcolm Bud McTaggart as Mickey O'Banion, Stanley Blystone as Det. Lt. Miller, Dick Elliott as Evans (Globe- Register Editor), Eleanor Counts as Gracie and Jack Mulhall as Reporter Burns.\n\n---\n\nSource: \"So's Your Aunt Emma\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 5 August 2012. http://en.wikipedia.org/wiki/So%27s_Your_Aunt_Emma.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "So's Your Aunt Emma",
            "Family",
            "Comedy (TV Genre)",
            "Comedy",
            "Crime",
            "Full",
            "Film",
            "1942",
            "Jean Yarbrough",
            "Meet the Mob"
        ]
    },
    {
        "Label": 23,
        "Video URL": "https://www.youtube.com/watch?v=MesOQvRGkvE",
        "Title": "The Amazing Adventure (1936) [Drama] [Romance]",
        "Description": "Ernest Bliss (Cary Grant) is a rich socialite suffering boredom. He makes a bet with a doctor, Sir James Aldroyd, that he can live a year without relying on any of his inherited wealth. He loses the bet for £50,000 when he has to draw money to wed poverty stricken Frances Clayton (Mary Brian), to save her from an unhappy marriage of convenience.\n\n---\n\nDirected and produced by Alfred Zeisler, written by John L. Balderston (writer) and E. Phillips Openheim (novel), starring Cary Grant as Ernest Bliss, Mary Brian as Frances Clayton, Peter Gawthorne as Sir James Alroyd, Henry Kendall as Lord Honiton, Leon M. Lion as Dorrington, John Turnbull as Masters, Arthur Hardy as Crawley, Iris Ashley as Clare, Garry Marsh as The Buyer, Andreas Malandrinos as Guiseppi asn Alfred Wellesley as Montague. \n\n---\n\nSource: \"The Amazing Quest of Ernest Bliss\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 11 March 2013. Web. 06 May 2013. http://en.wikipedia.org/wiki/The_Amazing_Adventure.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "The Amazing Adventure",
            "Ernest Bliss",
            "Quest",
            "Cary Grant",
            "drama",
            "romance",
            "comedy",
            "boredom",
            "marriage",
            "Mary Brian",
            "Alfred Zeisler",
            "movie",
            "film",
            "full",
            "complete",
            "Romance Film (TV Genre)"
        ]
    },
    {
        "Label": 25,
        "Video URL": "https://www.youtube.com/watch?v=iD-_issHc4A",
        "Title": "Lady of Burlesque (1943) [Comedy] [Horror]",
        "Description": "Lady of Burlesque (also known as \"The G-String Murders\" and in the UK, \"Striptease Lady\") is a 1943 American mystery film, based on the novel The \"G-String Murders\" written by strip tease artist Gypsy Rose Lee (with ghost-writing assistance from mystery writer Craig Rice). The plot concerns the murder of two strippers, backstage of a New York burlesque theatre and the detection of the killer.\n\nThe film is a faithful, if sanitized due to the censorship of the time, adaptation of the original novel, although Gypsy Rose Lee, who appears as a character in her own book, is here renamed \"Dixie Daisy\" (Stanwyck). Michael O'Shea plays her romantic interest, comedian Biff Brannigan, and Iris Adrian portrays a showgirl. Pinky Lee, a burlesque comic in real life, is another notable supporting player, as is Gerald Mohr as villain Louie Grindero. The film depicted as much as the censors would allow with respect to the precise nature of \"bumps\" and \"grinds\", and the slapdash nature of burlesque shows.\n\n---\n\nDirected by William A. Wellman, produced by Hunt Stromberg, written by James Gunn and Craig Rice, starring Barbara Stanwyck, Michael O'Shea and Iris Adrian.\n\n---\n\nSource: \"Lady of Burlesque\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 1 May 2013. Web. 12 June 2013. http://en.wikipedia.org/wiki/Lady_of_Burlesque.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "burlesque",
            "Lady Of Burlesque (Film)",
            "poisoning",
            "Film (Invention)",
            "striptease",
            "murder",
            "Comedy (TV Genre)",
            "comedian",
            "New York City (City/Town/Village)",
            "exotic dancer",
            "confession",
            "poison",
            "strangler",
            "Humor",
            "Horror",
            "full",
            "film",
            "movie",
            "complete"
        ]
    },
    {
        "Label": 17,
        "Video URL": "https://www.youtube.com/watch?v=40o3Yvcu3YI",
        "Title": "Nancy Drew... Reporter (1939) [Comedy] [Crime]",
        "Description": "Nancy Drew... Reporter is a 1939 American film directed by William Clemens and starring Bonita Granville, as Nancy Drew. Nancy Drew, competing in the local newspaper's amateur reporter contest, clears a girl named Eula Denning of murder charges.\n\n---\n\nDirected by William Clemens, produced by Bryan Foy, Hal B. Wallis and Jack L. Warner, written by Mildred Wirt Benson (stories) and Kenneth Gamet (screenplay), starring Bonita Granville as Nancy Drew, John Litel as Carson Drew, Frankie Thomas as Ted Nickerson, Mary Lee as Mary Nickerson, Dickie Jones as Killer Parkins, Larry Williams as Miles Lambert, Betty Amann as Eula Denning, Thomas E. Jackson as City Editor Bostwick, Olin Howland as Sergeant Entwhistle and Sheila Bromley as Bonnie Lucas.\n\n---\n\nSource: \"Nancy Drew... Reporter\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 21 June 2012. Web. 28 August 2012. http://en.wikipedia.org/wiki/Nancy_Drew..._Reporter.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Comedy (TV Genre)",
            "Crime (Broadcast Genre)",
            "News",
            "Reporter",
            "Fantasy",
            "Crime",
            "Movie",
            "Film",
            "Journalist (Profession)",
            "Bonita Granville",
            "Newspaper",
            "William Clemens"
        ]
    },
    {
        "Label": 19,
        "Video URL": "https://www.youtube.com/watch?v=NCVIU7xxUVU",
        "Title": "I'm from Arkansas (1944) [Comedy] [Romance]",
        "Description": "\"I'm from Arkansas\" is a 1944 American film directed by Lew Landers. The movie is not quite a classic, but it has a delightful surprise for the viewers.\n\n---\n\nDirected by Lew Landers, produced by E.H. Kleinert and Irving Vershel, written by Marcy Klauber (screenplay) and Joseph Carole (screenplay), starring Slim Summerville as Juniper Jenkins aka Pa, El Brendel as Oly, Iris Adrian as Doris, Bruce Bennett as Bob Hamline, Maude Eburne as Matilda Alden Jenkins aka Ma, Cliff Nazarro as Willie Childs, Al St. John as Farmer, Carolina Cotton as Abigail 'Abby' Alden, Danny Jackson as Efus Jenkins, Paul Newlan as Farmer, Harry Harvey as Stowe Packing Company Representative, Arthur Q. Bryan as Commissioner of Agriculture, John Hamilton as Harry Cashin, Vice President of, Slowe Packing Company, Douglas Wood as Governor of Arkansas, Walter Baldwin as, Packing Company Attorney, Flo Bert as Showgirl, The Pied Pipers as Quartet, The Sunshine Girls (including Mary Ford) as Girl Trio and Jimmy Wakely as Jimmy Wakely.\n\n---\n\nSource: \"I'm from Arkansas\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 20 March 2013. Web. 22 March 2013. http://en.wikipedia.org/wiki/I%27m_from_Arkansas.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Comedy",
            "Romance",
            "Romance (love)",
            "Romance (heroic Literature)",
            "I'm from Arkansas",
            "Arkansas",
            "Musical",
            "Film",
            "movie",
            "legal",
            "full",
            "download",
            "fun",
            "free",
            "Live"
        ]
    },
    {
        "Label": 22,
        "Video URL": "https://www.youtube.com/watch?v=3Y0CAZ5RTL4",
        "Title": "Three Husbands (1951) [Comedy]",
        "Description": "Three Husbands is a 1951 American film directed by Irving Reis. The movie is about a recently deceased playboy, who gets to heaven and is granted one wish like all newcomers will get there. He requests that he be able to see the reactions of three husbands, with whom he regularly played poker. What they didn´t know before is, that he had affairs with their wifes.\n\n---\n\nDirected by Irving Reis, produced by Isadore Goldsmith (producer) and Anthony Z. Landi (associate producer), written by Vera Caspary (story & screenplay), Edward Eliscu and Gertrude Purcell, starring Eve Arden as Lucille McCabe, Ruth Warrick as Jane Evans, Vanessa Brown as Mary Whittaker, Howard Da Silva as Dan McCabe, Shepperd Strudwick as Arthur Evans, Robert Karnes as Kenneth Whittaker, Emlyn Williams as Maxwell Bard, Billie Burke as Mrs. Jenny Bard Whittaker, Louise Erickson as Matilda Clegg, Jonathan Hale as Edward Wurdeman (Attorney at Law) and Jane Darwell as Mrs. Wurdeman.\n\n---\n\nSource: \"Three Husbands\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 April 2013. Web. 8 April 2013. http://en.wikipedia.org/wiki/Three_Husbands.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Three Husbands",
            "affairs",
            "affair",
            "wife",
            "wifes",
            "playboy",
            "decease",
            "comedy",
            "heaven",
            "wish",
            "poker",
            "movie",
            "film",
            "free",
            "full"
        ]
    },
    {
        "Label": 24,
        "Video URL": "https://www.youtube.com/watch?v=vMX37wkIXLo",
        "Title": "Killer Dill (1947) [Comedy] [Crime]",
        "Description": "\"Killer Dill\" is an American film directed by Lewis D. Collins. The movie is about the Door-to-door salesman Johnny Dill, an exact double of a notorious gangster, who finds himself struck between the forces of good and evil.\n\n---\n\nDirected by Lewis D. Collins, produced by Max M. King, written by Alan Friedman (story) and John O'Dea (writer), starring Stuart Erwin as Johnny 'Killer' Dill, Anne Gwynne as Judy Parker, Frank Albertson as William T. Allen, Mike Mazurki as Little Joe, Milburn Stone as Maboose, Dorothy Granger as Millie Gardner, Anthony Warde as Louie Moroni, Dewey Robinson as McGowan (house detective), , Ben Welden as Big Nick Moroni, Julie Gibson as Joan (model), Shirley Hunter as Gloria, Lola Jensen as Other model (with Joan\nMargaret Zane as Girl with Gloria) and Stanley Ross as Mushnose.\n\n---\n\nSource: \"Killer Dill\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 4 April 2013. Web. 29 May 2013. http://en.wikipedia.org/wiki/Killer_Dill.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "gangster",
            "mistaken identity",
            "comedy",
            "crime",
            "Killer Dill",
            "killer",
            "evil",
            "force",
            "notorious",
            "salesman",
            "classic",
            "movie",
            "film"
        ]
    },
    {
        "Label": 28,
        "Video URL": "https://www.youtube.com/watch?v=74Z18UELYs8",
        "Title": "Streamline Express (1935) [Comedy] [Drama] [Mystery]",
        "Description": "Broadway star Patricia Wallis (Evelyn Venable), after a quarrel, leaves the new show produced by Jimmy Hart (Victor Jory) and, not realizing that Hart is in love with her, she runs off to California with the wealthy, stodgy Freddy Arnold (Theodore von Eltz) with the announced intention of getting married. Jimmy discovers that Pat and Freddy will be aboard the crack new Streamline Express and he also boards, only to become involved in what appears to be a diamond theft. When Jimmy is falsely accused of the \"theft\" by blackmailer Gilbert Landon (Sidney Blackmer), Pat comes to her senses, precipitating a hasty and starling conclusion to the mystery of the missing diamond.\n\n---\n\nDirected by Leonard Fields, produced by Nat Levine (producer) and George Yohalem (supervising producer), written by Wellyn Totman (story), Leonard Fields (screenplay), David Silverstein (screenplay) and Olive Cooper (screenplay), starring Victor Jory as Jimmy Hart, Evelyn Venable as Patricia Wallace, Esther Ralston as Elaine Vincent, Erin O'Brien-Moore as Mary Forbes, Ralph Forbes as Fred Arnold, Sidney Blackmer as Gilbert Landon, Vince Barnett as Mr. Jones, Clay Clement as John Forbes, Bobby Watson as Gerald Wilson, Lee Moran as Larry Houston, Syd Saylor as Smith (Steward), Libby Taylor as Fawn (Patricia's Maid), Edward Hearn as Mack (Purser), Allan Cavan as Senior Conductor, Wade Boteler as Baggage Gateman, Harry Tyler as Steve, Tommy Bupp as Wilbur (Boy with Dog), Morgan Brown as Bartender, Jack Raymond as Baggage Man, C. Montague Shaw as Physician, Lynton Brent as Radio Operator and Theodore von Eltz as Freddy Arnold.\n\n---\n\nSource: \"Streamline Express\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 24 March 2013. Web. 28 July 2013. http://en.wikipedia.org/wiki/Streamline_Express.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "diamond",
            "blackmail",
            "Comedy (TV Genre)",
            "california",
            "love",
            "stage",
            "train",
            "extortionist",
            "speed",
            "railroad",
            "dog",
            "jewelry",
            "playboy",
            "drinking",
            "movie",
            "film",
            "full",
            "complete",
            "Action",
            "Drama"
        ]
    },
    {
        "Label": 30,
        "Video URL": "https://www.youtube.com/watch?v=0B85XLn5ePw",
        "Title": "Flying Wild (1941) [Comedy] [Drama]",
        "Description": "While pals Skinny (Donald Haines), Danny Graham (Bobby Jordan), Peewee (David Gorcey), Algy Reynolds (Eugene Francis), and Scruno (Sunshine Sammy Morrison) all work at the Reynolds Aviation Company, which is run by Algy's father (Herbert Rawlinson), Muggs (Leo Gorcey), the only one of the kids who refuses to work, spends his time flirting with an ambulance nurse named Helen (Joan Barclay). Helen, though, is in love with her test pilot boyfriend Tom (Dave O'Brien). One day, when Tom's plane crashes onto the plant airstrip, Reynolds suspects that the crash may have been the work of saboteurs. Later, on the airfield tarmac, Muggs jokingly appoints himself as the new operator of Dr. Richard Nagel (George Pembroke)'s ambulance plane and gives his pals a tour of the aircraft. Their playful games are soon brought to a halt by Nagel, the secret leader of a spy ring, who catches the boys on his plane and angrily orders them off.\n\nMr. Reynolds, certain that spies are working at the plant, asks Danny to act as a decoy so that the spies can be identified, and has him deliver to a downtown office a fake set of plans for a new bomb site. As Reynolds predicted, Nagel's men ambush Danny on his way to the office, but the plan goes awry when the detectives sent to trail Danny lose him. Danny eventually turns up unharmed some time later. When Muggs reports to Reynolds his suspicions that Nagel is behind the espionage ring, Reynolds dismisses the accusation as a product of the boy's imagination. Not convinced by Reynolds that Nagel is innocent, Muggs and Danny begin their own investigation into Nagel, starting with a visit to the doctor on the pretext of a fake ailment. The visit turns up nothing, however, and when Danny and Muggs return to the hangar, a suspicious \"accident\" that was apparently meant to harm them leaves Peewee injured. While Peewee recovers at the hospital, Tom nearly loses his life when he is unable to make contact with the control tower for a landing. The controller is later found bound and gagged in the tower, prompting the kids to resume their investigation in earnest.\n\nHelen provides the gang with further clues when she confirms that the ambulance plane was being flown on many unusual trips to Mexico, supposedly to deliver patients. When Helen tells the East Side Kids that a man named Forbes is the next \"patient\" to be transported, they rush to his house, where they find secret plans hidden in his head bandage. Disguising Danny as the transportee, the kids send Danny and Muggs on the flight to learn who is behind the espionage ring. Danny and Muggs soon find themselves in trouble, however, when Nagel, having found Forbes locked in his closet, tries to warn the pilot of the boys' ruse. Meanwhile, Tom learns of the dangerous mission and goes after the ambulance plane in his own plane. Tom arrives in Mexico in time to save Danny and Muggs, and all the spies are arrested. Back at the plant, Reynolds rewards Muggs for his heroism by giving him a job, but his stint there is short-lived as he is soon distracted by a pretty woman and crashes a plane.\n\n---\n\nDirected by William West, produced by Sam Katzman, written by Al Martin, starring Leo Gorcey as Muggs McGinnis, Bobby Jordan as Danny Graham, Sunshine Sammy Morrison as Scruno, David Gorcey as Peewee, Donald Haines as Skinny, Eugene Francis as Algy Reynolds, Bobby Stone as Louie, Joan Barclay as Helen Munson, Dave O'Brien as Tom Lawson, George Pembroke as Dr. Richard Nagel III, Herbert Rawlinson as Mr. Reynolds, Dennis Moore as George, Forrest Taylor as Forbes, Robert F. Hill as Woodward, Mary Bovard as Mazie, , George Eldredge as Man, Alden \"Stephen\" Chase as Jack, Henchman, \nAl Ferguson, Jack Kenny, Carey Loftin, Bud Osborne, Eddie Parker, and Dick Scott as Henchmen.\n\n---\n\nSource: \"Flying Wild\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 13 August 2013. Web. 26 August 2013. http://en.wikipedia.org/wiki/Flying_Wild.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Flying Wild Alaska (TV Program)",
            "Comedy (TV Genre)",
            "Drama",
            "classic film",
            "movie",
            "Film (Film)",
            "doctor",
            "nurse",
            "fog",
            "mexico",
            "pilot",
            "fire",
            "east side kids",
            "investigator",
            "Flying Wild (Film)",
            "Comedy-drama (TV Genre)"
        ]
    },
    {
        "Label": 27,
        "Video URL": "https://www.youtube.com/watch?v=Xb3lus_bPcI",
        "Title": "Irish Luck (1939) [Action] [Adventure] [Comedy]",
        "Description": "\"Irish Luck\" is anAmerican film directed by Howard Bretherton. The film is also known as \"Amateur Detective\" in the United Kingdom. Buzzy O'Brien is a bellhop in a hotel where a guest is murdered. The police blame Kitty Monahan and Buzzy succeeds in helping her escape and hides her at his home with his mother. Buzzy and his pal Jefferson manage to fumble their way to finding the real killer who was after the stolen bonds carried by the victim. Based on Charles Molyneaux Brown's story \"Death Hops the Bells.\"\n\n---\n\nDirected by Howard Bretherton, Scott R. Dunlap (supervising producer) and Grant Withers (associate producer), written by Charles M. Brown (story) and Mary McCarthy (screenplay), starring Frankie Darro as Buzzy O'Brien, Dick Purcell as Steve Lanahan, Lillian Elliott as Mrs. O'Brien, Dennis Moore as Jim Monahan, James Flavin as Hotel Detective Fluger, Sheila Darcy as Kitty Monahan, Mantan Moreland as Jefferson, Ralph Peters as Detective Jenkins, Tristram Coffin as Mr. Mace - Hotel Desk Clerk, Pat Gleason as Banning - Bond Robber, Gene O'Donnell as Bond Robber, Donald Kerr as Reporter, Howard M. Mitchell as Hotel Manager and Aloha Wray as Dancer.\n\n---\n\nSource: \"Irish Luck (1939 film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 11 May 2013. Web. 23 June 2013. http://en.wikipedia.org/wiki/Irish_Luck_(1939_film).\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Irish Luck (Film)",
            "Film (Film)",
            "Comedy (TV Genre)",
            "Action",
            "Adventure",
            "murder",
            "killer",
            "bellhop",
            "henchman",
            "dilemma",
            "rescue",
            "robbery",
            "gunfire",
            "corpse",
            "robber",
            "comedy",
            "full",
            "complete"
        ]
    },
    {
        "Label": 31,
        "Video URL": "https://www.youtube.com/watch?v=fjVhQDdZDRk",
        "Title": "Midnight Manhunt (1945) [Comedy] [Crime] [Mystery]",
        "Description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | Midnight Manhunt begins with the shooting death of a master criminal who expires in a wax museum. Reporter Sue Gallagher (Ann Savage) is first on the scene, but she is soon in competition with her boyfriend, fellow reporter Pete Willis (William Gargan). The killer traps Sue in the wax museum when he returns there looking for the body. Leo Gorcey plays the caretaker of the wax museum.\n\n---\n\nDirected by William C. Thomas, produced by Maxwell Shane, written by David Lang, starring William Gargan as Pete Willis, Ann Savage as Sue Gallagher, Leo Gorcey as Clutch Tracy, George Zucco as Jelke, Paul Hurst as Murphy, Don Beddoe as Det. Lt. Max Hurley, Charles Halton as Henry Miggs, George E. Stone as Joe Wells, Robert Barron as Cop with Hurley, Edgar Dearing as Police Desk Sergeant, Paul Harvey as Mr. McAndrews (Night Editor) and Ben Welden as Hotel Manager.\n\n---\n\nSource: \"Midnight Manhunt\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 3 January 2013. Web. 23 December  2013. http://en.wikipedia.org/wiki/Midnight_Manhunt.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Midnight Manhunt",
            "Comedy",
            "Funny",
            "Humor",
            "Crime",
            "Mystery",
            "gangster",
            "dead end kids",
            "wax museum",
            "bowery boys",
            "film",
            "movie",
            "full",
            "free",
            "complete",
            "Film (Film)"
        ]
    },
    {
        "Label": 26,
        "Video URL": "https://www.youtube.com/watch?v=ANsf_axGe6g",
        "Title": "The Bashful Bachelor (1942) [Comedy]",
        "Description": "The Bashful Bachelor is a 1942 American film directed by Malcolm St. Clair. The movie is about Lum Edwards, who's annoyed with his partner in Pine Ridge's Jot-'em-Down general store, Abner Peabody, because Abner has swapped their delivery car for a racehorse. Lum is also too timid to propose to Geraldine, so he involves Abner in a \"rescue\" effort which nearly gets both of them killed. They try again, and this time Geraldine is impressed. Lum writes a proposal note, but Abner, by mistake, delivers it to the Widder Abernathy, who has been ready to remarry for years. This puts Lum in a peck of trouble until the sheriff appears with the Widder's long-gone and hiding husband.\n\n---\n\nDirected and produced by W. Lee Wilder, written by Myles Wilder, Paul Langton as Frank Parrish, Leslie Denison as Peter Wells, Taru Shimada as Subra, Rollin Moriyana as Leva\nand Robert Kino as Inspector Karma.\n\n---\n\nSource: \"The Bashful Bachelor\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 23 March 2013. Web. 12 June 2013. http://en.wikipedia.org/wiki/The_Bashful_Bachelor.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "sequel",
            "rural",
            "comedy",
            "film",
            "movie",
            "complete",
            "full",
            "The Bashful Bachelor",
            "Bashful",
            "Bachelor",
            "racehorse",
            "horse",
            "car",
            "mistake",
            "kill",
            "remarry"
        ]
    },
    {
        "Label": 32,
        "Video URL": "https://www.youtube.com/watch?v=EWkajXClyds",
        "Title": "Beat The Devil (1953) [Action] [Adventure] [Comedy]",
        "Description": "Beat the Devil is a 1953 British film directed by John Huston, starring Humphrey Bogart, Jennifer Jones and Gina Lollobrigida, and featuring Robert Morley, Peter Lorre and Bernard Lee. Huston and Truman Capote wrote the screenplay, loosely based upon a novel of the same name by British journalist Claud Cockburn, writing under the pseudonym James Helvick. Houston made the film as a parody of a genre of film. Although often described as a parody of The Maltese Falcon, which Huston directed and in which Bogart and Lorre appeared, this is not the case. \n\nThe script, written on a day-to-day basis as the film was shot, concerns the adventures of a motley crew of swindlers and ne'er-do-wells trying to claim land rich in uranium deposits in Kenya as they wait in a small Italian port to travel aboard a tramp steamer en route to Mombasa.\n\n---\n\nPlot: Billy Dannreuther (Humphrey Bogart) is a formerly-wealthy American who has fallen on hard times. He is reluctantly working with four crooks: Peterson (Robert Morley), ex-Nazi Julius O'Hara (Peter Lorre), Major Jack Ross (Ivor Barnard) and Ravello, who are trying to acquire uranium-rich land in British East Africa. Billy suspects that Major Ross murdered a British Colonial officer, who threatened to expose their plan. While waiting in Italy for passage to Africa, Billy and his wife Maria (Gina Lollobrigida) meet a British couple: Harry (Edward Underdown) and Gwendolen Chelm (Jennifer Jones), who plan to travel on the same ship. Harry is a very proper and traditional Englishman, while Gwendolen is flighty and fanciful and a compulsive liar. Billy and Gwendolen have an affair, while Maria flirts with Harry. Peterson becomes suspicious that the Chelms may be attempting to acquire the uranium themselves. His suspicions are unfounded, but they seem to him to be confirmed by Gwendolen, who lies about her husband and exaggerates his importance.\n\nBilly and Peterson are in a car accident and wrongly reported to have been killed. In order to replace Peterson's lost capital, Ravello approaches Harry Chelm and explains their scheme. Just then, to everyone's surprise, Billy and Peterson return to the hotel alive and unharmed. The purser announces that the ship is at last ready to sail. On board, Harry reveals that he knows about Peterson's scheme and intends to inform the authorities. Peterson orders Major Ross to kill Harry, but Billy thwarts the murder attempt. Harry's outraged accusations alienate the ship's drunken captain, who locks Harry in the brig, where he is uncomfortable, but safe from Major Ross.\n\nThe ship's engine malfunctions and the ship sinks. When Billy goes to free Harry he finds that Harry has escaped and left the ship, intending to swim ashore. The passengers abandon the sinking ship in a lifeboat and land on an African beach, where they are arrested by Arab soldiers. They are interrogated by Ahmed, an Arab official who suspects that they may be spies or revolutionaries. Billy befriends Ahmed by talking with him about Rita Hayworth, upon whom Ahmed has a crush. Billy persuades him to send the party back to Italy. When they land, they are met and questioned by a Scotland Yard detective (Bernard Lee), who is investigating the murder of the Colonial officer. Gwendolen reveals Peterson's scheme, and his involvement in the murder, and his attempt to murder Harry, to the detective, who promptly arrests Peterson, O'Hara, Major Ross and Ravello. As the four crooks are led away in handcuffs, Gwendolen receives a telegram from British East Africa saying that Harry has acquired the land Peterson and the others meant to steal, and is now extremely rich and willing to forgive Gwendolen, Billy and Maria. Billy laughs happily, saying \"This is the end, the end!\".\n\n---\n\nDirected and produced by John Huston, screenplay by John Huston and Truman Capote, based on the novel Beat the Devil (1951) by Claud Cockburn (as James Helvick), starring Humphrey Bogart as Billy Dannreuther, Jennifer Jones as Mrs. Gwendolen Chelm, Gina Lollobrigida as Maria Dannreuther, Robert Morley as Peterson, Peter Lorre as Julius O'Hara, Edward Underdown as Harry Chelm, Ivor Barnard as Maj. Jack Ross, Marco Tulli as Ravello, Bernard Lee as Insp. Jack Clayton, Mario Perrone as Purser on SS Nyanga, Giulio Donnini as Administrator, Saro Urzì as Captain of SS Nyanga, Aldo Silvani as Charles, restaurant owner and Juan de Landa as Hispano-Suiza Driver\n\n---\n\nSource: \"Beat the Devil (film)\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc..  27 November 2016. Web. 29 December 2016. https://en.wikipedia.org/wiki/Beat_the_Devil_(film)\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "Humphrey Bogart",
            "Jennifer Jones",
            "Gina Lollobrigida",
            "Beat The Devil",
            "full movie",
            "free",
            "film",
            "Action]",
            "Adventure",
            "Comedy",
            "Kenya",
            "Mombasa",
            "Peter Lorre",
            "Robert Morley"
        ]
    },
    {
        "Label": 29,
        "Video URL": "https://www.youtube.com/watch?v=fiSjeLhg25w",
        "Title": "My Man Godfrey (1936) [Romance] [Comedy]",
        "Description": "If you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe | \"My Man Godfrey\" is an American screwball comedy film directed by Gregory La Cava. The screenplay was written by Morrie Ryskind, with uncredited contributions by La Cava, based on \"1011 Fifth\", a short novel by Eric Hatch. The story concerns a socialite who hires a derelict to be her family's butler, only to fall in love with him, much to his dismay.\n\nDuring the Great Depression, Godfrey \"Smith\" (William Powell) is living alongside other men down on their luck at the city dump. One night, spoiled socialite Cornelia Bullock (Gail Patrick) offers him five dollars to be her \"forgotten man\" for a scavenger hunt. Annoyed, he advances on her, causing her to retreat and fall on a pile of ashes. She leaves in a fury, much to the glee of her younger sister, Irene (Carole Lombard). After talking with her, Godfrey finds her to be kind, if a bit scatter-brained. He offers to go with Irene to help her beat Cornelia. In the ballroom of the Waldorf-Ritz Hotel, Irene's long-suffering businessman father, Alexander Bullock (Eugene Pallette), waits resignedly as his ditsy wife, Angelica (Alice Brady), and her mooching \"protégé\" Carlo (Mischa Auer) play the frivolous game. Godfrey arrives and is \"authenticated\" by the scavenger hunt judge as a \"forgotten man\". He then addresses the idle rich, expressing his contempt for their antics. Irene is apologetic and offers him a job as the family butler, which he gratefully accepts.\n\nThe next morning, Godfrey is shown what to do by the sardonic, wise-cracking maid, Molly (Jean Dixon), the only servant who has been able to put up with the antics of the family. She warns him that he is just the latest in a long line of butlers. Only slightly daunted, he proves to be surprisingly competent, although Cornelia still holds a sizeable grudge. On the other hand, Irene considers Godfrey to be her protégé, and is thrilled by his success. A complication arises when a guest, Tommy Gray (Alan Mowbray), greets Godfrey familiarly as an old friend. Godfrey quickly ad-libs that he was Tommy's valet at school. Tommy plays along, mentioning Godfrey's non-existent wife and five children. Dismayed, Irene impulsively announces her engagement to the surprised Charlie Van Rumple (Grady Sutton), but she soon breaks down in tears and flees after being politely congratulated by Godfrey. Over lunch the next day, Tommy is curious to know what one of the elite \"Parkes of Boston\" is doing as a servant. Godfrey explains that a broken love affair had left him considering suicide, but the optimistic, undaunted attitude of the men living at the dump rekindled his spirit.\n\nMeanwhile, when everything she does to make Godfrey's life miserable fails, Cornelia sneaks into his room and plants her pearl necklace under his mattress. She then calls the police to report her \"missing\" jewelry. To Cornelia's surprise, the pearls do not turn up, even when she suggests they check Godfrey's bed. Mr. Bullock realizes his daughter has orchestrated the whole thing and sees the policemen out. The Bullocks then send their daughters off to Europe to get Irene away from Godfrey. When they return, Cornelia implies that she intends to seduce Godfrey. Worried, Irene stages a fainting spell and falls into Godfrey's arms. He carries her to her bed, but while searching for smelling salts, he realizes she's faking when he sees her (in a mirror) sit up briefly. In revenge, he puts her in the shower and turns on the cold water full blast. Far from quenching her attraction, this merely confirms her hopes: \"Oh Godfrey, now I know you love me...You do or you wouldn't have lost your temper.\"\n\nWhen confronted by the rest of the family, Godfrey quits. But Mr. Bullock has more pressing concerns...\n\n---\n\nDirected and produced by Gregory La Cava, written by Eric Hatch, Morrie Ryskind and Gregory LaCava, starring William Powell as Godfrey Park, Carole Lombard as Irene Bullock, Alice Brady as Angelica Bullock, Gail Patrick as Cornelia Bullock, Eugene Pallette as Alexander Bullock, Jean Dixon as Molly, Alan Mowbray as Tommy Gray, Mischa Auer as Carlo, Pat Flaherty as Mike Flaherty, Robert Light as Faithful George and Grady Sutton as Charlie Van Rumple.\n\n---\n\nSource: \"My Man Godfrey\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 7 August 2013. Web. 26 August 2013. http://en.wikipedia.org/wiki/My_Man_Godfrey.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
        "Tags": [
            "My Man Godfrey (Film)",
            "Romantic Comedy (TV Genre)",
            "butler",
            "love",
            "romance",
            "classic movie",
            "film",
            "complete",
            "full",
            "Romance Film (TV Genre)",
            "cocktail party",
            "Romance (Musical Genre)",
            "jazz music",
            "monkey",
            "piano",
            "high society",
            "drunkenness",
            "horse",
            "satire",
            "ashes"
        ]
    }
]